<?php

return [
    'action' => [
        'schedule' => [
            'label' => 'စီစဥ်မည်',
        ],
    ],
    'notification' => [
        'submitted' => [
            'title' => 'သင်၏မေးမြန်းမှုအတွက်ကျေးဇူးတင်ပါတယ်! မကြာမီပြန်လည်ဆက်သွယ်ပါမည်။',
        ],
        'assigned' => [
            'title' => 'အလားအလာရှိသူ: :lead_name အား သင့်ထံ တာဝန်ပေးလိုက်ပါသည်',
            'body' => 'သင့်ထံသို့ အလားအလာရှိသူတစ်ယောက်အား တာဝန်ပေးလိုက်သည်၊​ :lead_name. :contact အားအသုံးပြုပြီးဆက်သွယ်လိုက်ပါ၊ အသေးစိတ်ကြည့်ရှုရန်အောက်ပါ ခလုပ်အားနှိပ်ပါ။',
        ],
        'agent_assigned' => [
            'title' => 'အလားအလားရှိသူကို :agent အား တာဝန်ပေးလိုက်ပါသည်',
        ],
        'property_created' => [
            'title' => 'အိမ်ခြံမြေပြုလုပ်မှု အောင်မြင်ပါသည်',
        ],
        'contacted' => [
            'title' => 'အလားအလာရှိသူအား ဆက်သွယ်ပြီးကြောင်း သတ်မှတ်ပြီးပါပြီ',
        ],
        'scheduled' => [
            'title' => 'အလားအလာရှိသူအား စီစဥ်ပြီးကြောင်း သတ်မှတ်ပြီးပါပြီ',
        ],
        'closed' => [
            'title' => 'အလားအလာရှိသူအား ဝန်ဆောင်မှု ပိတ်လိုက်ပါပြီ',
        ],
    ],
];
