<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'အမည်',
    'column.guard_name' => 'Guard Name',
    'column.roles' => 'Roles',
    'column.permissions' => 'ခွင့်ပြုချက်များ',
    'column.updated_at' => 'နောက်ဆုံး ပြင်ဆင်ချိန်',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'အမည်',
    'field.guard_name' => 'Guard Name',
    'field.permissions' => 'ခွင့်ပြုချက်များ',
    'field.select_all.name' => 'အကုန်ရွေးမည်',
    'field.select_all.message' => 'ဤroleတွင် <span class="font-medium text-primary">ပါဝင်ထားသော</span> ခွင့်ပြုချက်များကို အကုန်ရွေးမည်',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'လုပ်ပိုင်ခွင့်များ',
    'nav.role.label' => 'Role များ',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'role',
    'resource.label.roles' => 'Role များ',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Entities',
    'resources' => 'စာရင်းများ',
    'widgets' => 'Widgets',
    'pages' => 'စာမျက်နှာများ',
    'custom' => 'စိတ်ကြိုက် ခွင့်ပြုချက်များ',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'သင့်တွင် လုပ်ဆောင်ရန် ခွင့်ပြုချက်မရှိပါ။',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'ကြည့်ခွင့်',
        'view_any' => 'ကြည့်ခွင့်',
        'create' => 'ဖန်တီးခွင့်',
        'update' => 'ပြင်ခွင့်',
        'delete' => 'ဖျက်ခွင့်',
        'delete_any' => 'ကြိုက်တာ ဖျက်ခွင့်',
        'force_delete' => 'အပြီး ဖျက်ခွင့်',
        'force_delete_any' => 'ကြိုက်တာ အပြီးဖျက်ခွင့်',
        'restore' => 'ပြန်ယူခွင့်',
        'reorder' => 'ပြန်စီခွင့်',
        'restore_any' => 'ကြိုက်တာ ပြန်ယူခွင့်',
        'replicate' => 'ပုံတူပွားခွင့်',
        'Posted' => 'တင်ခြင်း',
        'Rented' => 'ငှားခြင်း',
        'Sold Out' => 'ရောင်းခြင်း',
    ],
];
